art/note/chapter06_riscv_book.org
#+title: Memory From RISCV book
* Chapter six: Memory Heirarchy

The chapter is about /Memory Heirarchy/. You should already know a
little about it if you have read /CSAPP/.

Note that the note is based on the side notes. You need to check both side notes and books. 

** Intro 
- /principle of locality/ 
  - /temporal locality/: like frequently-accessed data
  - /spatial locality/: like an array

- /memory heirarchy/: something like a pyramid.

-----------------

- /Blocks/: Cache memory is organized into a series of blocks, also known as lines 1. Each block contains a certain amount of data and has its own block address 1. The size of the block and the overall capacity of the cache are two important factors that affect the performance of the cache memory 1. The spatial aspect suggests that instead of fetching just one item from the main memory to the cache, it is useful to fetch several items that reside at adjacent addresses as well 2.
- /hit/, /hit rate/: if the block is the block that we want, then we hit. We could also miss, that is, not to hit. If we miss, we have to access lower level to find the block that we want, and send it to the cache. Hit rate is *the fraction of memory accesses found in the upper level*.  Hit rate is the measure of the performance of the cache.
- /hit time/, /miss penalty/: Hit time is the time we need to access data when hit. When we miss, we have to retrieve data from lower level. The extra time we spend is the miss penalty. 

#+BEGIN_NOTE
miss penalty: The time required to fetch a block into a level of
the memory hierarchy from the lower level, including the time to
*access the block*, *transmit it from one level to the other*, *insert it
in the level that experienced the miss*, and then *pass the block to the
requestor*.
#+END_NOTE

----------

Here is a self check: 

Which of the following statements are generally true?
1. Memory hierarchies take advantage of temporal locality.
2. On a read, the value returned depends on which blocks are in the cache.
3. Most of the cost of the memory hierarchy is at the highest level.
4. Most of the capacity of the memory hierarchy is at the lowest level.

And here is the answer:
1. True. Memory hierarchies take advantage of temporal locality by keeping recently accessed data in the faster, higher levels of the hierarchy so that future accesses to that data can be faster.
2. True. On a read, the value returned depends on whether the requested data is present in the cache or not. If it is present, the value is returned quickly from the cache. If it is not present, the value must be fetched from a lower level of the memory hierarchy, which takes longer.
3. False. Most of the cost of the memory hierarchy is at the lowest level (usually secondary storage), which is typically much larger and more expensive than the higher levels (such as cache and main memory).
4. True. Most of the capacity of the memory hierarchy is at the lowest level (usually secondary storage), which is typically much larger than the higher levels (such as cache and main memory).

