art/note/chapter06_riscv_book.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-05-31 Wed 12:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Memory From RISCV book</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Memory From RISCV book</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgaebea5d">1. Chapter six: Memory Heirarchy</a>
<ul>
<li><a href="#org028e5bb">1.1. Intro</a></li>
<li><a href="#org1f457df">1.2. Memory Technologies</a></li>
<li><a href="#org03f72a4">1.3. The Basic of Caches</a>
<ul>
<li><a href="#org7e3f789">1.3.1. A Small Intro</a></li>
<li><a href="#orga85c814">1.3.2. Accessing to the Cache</a></li>
<li><a href="#orgb8d28a8">1.3.3. Handling Cache Misses</a></li>
<li><a href="#org6b5eead">1.3.4. Handling Writes</a></li>
<li><a href="#org57819bf">1.3.5. Summary of the Section</a></li>
</ul>
</li>
<li><a href="#org0454f45">1.4. Measuring and Improving Cache Performance</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgaebea5d" class="outline-2">
<h2 id="orgaebea5d"><span class="section-number-2">1</span> Chapter six: Memory Heirarchy</h2>
<div class="outline-text-2" id="text-1">
<p>
The chapter is about <i>Memory Heirarchy</i>. You should already know a
little about it if you have read <i>CSAPP</i>.
</p>

<p>
Note that the note is based on the side notes. You need to check both side notes and books. 
</p>
</div>

<div id="outline-container-org028e5bb" class="outline-3">
<h3 id="org028e5bb"><span class="section-number-3">1.1</span> Intro</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><i>principle of locality</i> 
<ul class="org-ul">
<li><i>temporal locality</i>: like frequently-accessed data</li>
<li><i>spatial locality</i>: like an array</li>
</ul></li>

<li><i>memory heirarchy</i>: something like a pyramid.</li>
</ul>

<hr />

<ul class="org-ul">
<li><i>Blocks</i>: Cache memory is organized into a series of blocks, also known as lines 1. Each block contains a certain amount of data and has its own block address 1. The size of the block and the overall capacity of the cache are two important factors that affect the performance of the cache memory 1. The spatial aspect suggests that instead of fetching just one item from the main memory to the cache, it is useful to fetch several items that reside at adjacent addresses as well 2.</li>
<li><i>hit</i>, <i>hit rate</i>: if the block is the block that we want, then we hit. We could also miss, that is, not to hit. If we miss, we have to access lower level to find the block that we want, and send it to the cache. Hit rate is <b>the fraction of memory accesses found in the upper level</b>.  Hit rate is the measure of the performance of the cache.</li>
<li><i>hit time</i>, <i>miss penalty</i>: Hit time is the time we need to access data when hit. When we miss, we have to retrieve data from lower level. The extra time we spend is the miss penalty.</li>
</ul>

<div class="NOTE">
<p>
miss penalty: The time required to fetch a block into a level of
the memory hierarchy from the lower level, including the time to
<b>access the block</b>, <b>transmit it from one level to the other</b>, <b>insert it
in the level that experienced the miss</b>, and then <b>pass the block to the
requestor</b>.
</p>

</div>

<hr />

<p>
Here is a self check: 
</p>

<p>
Which of the following statements are generally true?
</p>
<ol class="org-ol">
<li>Memory hierarchies take advantage of temporal locality.</li>
<li>On a read, the value returned depends on which blocks are in the cache.</li>
<li>Most of the cost of the memory hierarchy is at the highest level.</li>
<li>Most of the capacity of the memory hierarchy is at the lowest level.</li>
</ol>

<p>
And here is the answer:
</p>
<ol class="org-ol">
<li>True. Memory hierarchies take advantage of temporal locality by keeping recently accessed data in the faster, higher levels of the hierarchy so that future accesses to that data can be faster.</li>
<li>True. On a read, the value returned depends on whether the requested data is present in the cache or not. If it is present, the value is returned quickly from the cache. If it is not present, the value must be fetched from a lower level of the memory hierarchy, which takes longer.</li>
<li>False. Most of the cost of the memory hierarchy is at the lowest level (usually secondary storage), which is typically much larger and more expensive than the higher levels (such as cache and main memory).</li>
<li>True. Most of the capacity of the memory hierarchy is at the lowest level (usually secondary storage), which is typically much larger than the higher levels (such as cache and main memory).</li>
</ol>
</div>
</div>
