art/note/chapter06_riscv_book.org
** Memory Technologies

- /DRAM/ and /SRAM/: /D/ stands for *dynamic*, which is to say that the value it stored have to be refreshed every once a while or it will fade away. /S/ stands for *static*, saying that the value will not fade away.
- /Flash Memory/: widely used in cell phone. The store unit can be worn out, that is to say, if you use the unit too often, it will not working. To avoid the exact problem, Flash Memory can spread the writes to the flash memory. The controller may slow down the performance a little bit, but worth it. The controller is always needed, unless you have an external controller. Also, the controller can used to avoid the badly-manufactured part of the flash memory.
- /Magnetic Disk/: with a big capacity, whose structure is introduced in later section.

---------------

The difference of /DRAM/ and /SRAM/: Answered by *Google Bard*

Static RAM (SRAM) is a type of random access memory (RAM) that stores data in flip-flops. Flip-flops are electronic circuits that can store a single bit of data, either a 0 or a 1. As long as power is applied to the SRAM, the data stored in the flip-flops will be maintained indefinitely.

Dynamic RAM (DRAM) is a type of random access memory (RAM) that stores data in capacitors. Capacitors are electronic components that can store an electric charge. The amount of charge stored in a capacitor can be used to represent a 0 or a 1. However, the charge in a capacitor will slowly leak away over time. Therefore, DRAM must be refreshed periodically to prevent the data from being lost.
The main difference between SRAM and DRAM is that SRAM stores data in flip-flops, while DRAM stores data in capacitors. This difference in storage mechanism has several implications:

- Basic Unit: SRAM use /flip-flops/ and DRAM use /capacitors/. A filp-flop consists of six transistors maybe, and a capacitor is made of one or two transistors.
- Speed: SRAM is faster than DRAM because it does not need to be refreshed periodically.
- Cost: SRAM is more expensive than DRAM because it requires more transistors per bit of storage.
- Density: DRAM is denser than SRAM because it can store more data in the same amount of space.
- Refresh rate: SRAM does not need refreshing, while that DRAM need refreshing.

-------

- /two-level coding structure/: we refresh a row every time, leaving time for we to access.

In the context of DRAM (Dynamic Random Access Memory), a row refers to a set of memory cells that share a common word line. A word line is an electrical line that selects a row of cells in the memory array. When a row is selected, all the cells in that row can be accessed simultaneously.

If a word is 32 bits long and there are 1024 words, then there would be 1024 rows and each row would have 32 bits. Each bit in a row would correspond to one memory cell. 

- /buffer, bank, and the structure/

A DRAM has a *buffer* (if it has one bank), the buffer is used to hold a row of data. It works like SRAM. A *row* is loaded to the buffer for the sake of temporal locality. There is a buffer for one *bank*. A DRAM can have many banks. So DRAM has many buffers available. For more information please check the book.

There is the quote to the book: 

#+begin_quote
The row organization that helps with refresh also helps with
performance. To improve performance, DRAMs buffer rows for repeated
access. The buffer acts like an SRAM; by changing the address, random
bits can be accessed in the buffer until the next row access. This
capability improves the access time significantly, since the access
time to bits in the row is much lower. Making the chip wider also
improves the memory bandwidth of the chip. When the row is in the
buffer, it can be transferred by successive addresses at whatever the
width of the DRAM is (typically 4, 8, or 16 bits), or by specifying a
block transfer and the starting address within the buffer.

Sustaining that much bandwidth requires clever organization inside the
DRAM.  Instead of just a faster row buffer, the DRAM can be internally
organized to read or write from multiple banks, with each having its
own row buffer. Sending an address to several banks permits them all
to read or write simultaneously. For example, with four banks, there
is just one access time and then accesses rotate between the four
banks to supply four times the bandwidth. This rotating access scheme
is called *address interleaving*.
#+end_quote
End of the Quote.

---------
- /SDRAM, in a burst/

/S/ stands for synchronize. It is to say, a clock is added to DRAM to deal with synchronization problem. Let us see what *New Bing* said: 

#+begin_quote
SDRAM (Synchronous Dynamic Random Access Memory) is able to transfer data in a burst without having to specify additional address bits by using a clock to synchronize the data transfers. Once the initial address is specified, the clock is used to transfer the successive data in the burst. The clock generates a series of pulses at regular intervals, and each pulse triggers the transfer of the next piece of data in the burst. This means that the data can be transferred more quickly and efficiently without having to specify additional address bits for each piece of data in the burst.
#+end_quote

End of the Quote.

And there is actually a weird question: what is "in a burst"? It seems that "a burst transfer" is different to "a block transfer". A burst is like ejaculation---it starts and just goes on till the end. A block is like I don't know, 搬砖? Anyway, this is what *NB* said: 

#+begin_quote
A burst transfer refers to the transfer of a group of data sequentially in rapid succession. In the context of synchronous DRAMs (Dynamic Random Access Memory), this means that once the initial address is specified, the successive data in the burst can be transferred without having to specify additional address bits. Instead, the clock is used to transfer the successive data in the burst.

A block transfer, on the other hand, refers to the transfer of a block of data from one location to another. The difference between a burst and a block transfer is that a burst transfer transfers data sequentially in rapid succession, while a block transfer transfers a block of data as a whole.
#+end_quote
End of the Quote.
--------- 
- /flash memory, wear leveling/

I shall just copy the text, since it is not long.

#+begin_quote
*Flash memory* is a type of electrically erasable programmable read-only memory
(EEPROM).

Unlike disks and DRAM, but like other EEPROM technologies, /writes can wear out
flash memory bits/. To cope with such limits, most flash products include a controller
to /spread the writes/ by remapping blocks that have been written many times to less
trodden blocks. This technique is called *wear leveling*. With wear leveling, personal
mobile devices are very unlikely to exceed the write limits in the flash. Such wear
leveling lowers the potential performance of flash, but it is needed unless higher-level 
software monitors block wear. Flash controllers that perform wear leveling can
also improve yield by mapping out memory cells that were manufactured incorrectly.
#+end_quote
End of the Quote. "trodden" is "tread".

-------------
- /DIMM/

You may skip the part. This part seems not so important. And here the text that is processed by *NB*:
#+begin_quote
A DIMM (Dual In-line Memory Module) is a small circuit board that contains one or several dynamic random-access memory (DRAM) chips. DIMMs are commonly used to add memory to personal computers, workstations, printers, and servers. They are designed to be 64 bits wide, enabling fast data transfer.

The text you provided explains that memory for servers is commonly sold on DIMMs. These modules typically contain 4-16 DRAMs and are normally organized to be 8 bytes wide for server systems. A DIMM using DDR4-3200 SDRAMs could transfer at a rate of 8 × 3200 = 25,600 megabytes per second. Such DIMMs are named after their bandwidth: PC25600.

Since a DIMM can have many DRAM chips and only a portion of them are used for a particular transfer, the term “memory rank” is used to refer to the subset of chips in a DIMM that share common address lines.
#+end_quote
End of the Quote. I have no idea what is "memory rank".

--------------
- /Magnetic Disk/

Let us just skip this part
--------------
