art/note/chapter06_riscv_book.html

<div id="outline-container-org1f457df" class="outline-3">
<h3 id="org1f457df"><span class="section-number-3">1.2</span> Memory Technologies</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><i>DRAM</i> and <i>SRAM</i>: <i>D</i> stands for <b>dynamic</b>, which is to say that the value it stored have to be refreshed every once a while or it will fade away. <i>S</i> stands for <b>static</b>, saying that the value will not fade away.</li>
<li><i>Flash Memory</i>: widely used in cell phone. The store unit can be worn out, that is to say, if you use the unit too often, it will not working. To avoid the exact problem, Flash Memory can spread the writes to the flash memory. The controller may slow down the performance a little bit, but worth it. The controller is always needed, unless you have an external controller. Also, the controller can used to avoid the badly-manufactured part of the flash memory.</li>
<li><i>Magnetic Disk</i>: with a big capacity, whose structure is introduced in later section.</li>
</ul>

<hr />

<p>
The difference of <i>DRAM</i> and <i>SRAM</i>: Answered by <b>Google Bard</b>
</p>

<p>
Static RAM (SRAM) is a type of random access memory (RAM) that stores data in flip-flops. Flip-flops are electronic circuits that can store a single bit of data, either a 0 or a 1. As long as power is applied to the SRAM, the data stored in the flip-flops will be maintained indefinitely.
</p>

<p>
Dynamic RAM (DRAM) is a type of random access memory (RAM) that stores data in capacitors. Capacitors are electronic components that can store an electric charge. The amount of charge stored in a capacitor can be used to represent a 0 or a 1. However, the charge in a capacitor will slowly leak away over time. Therefore, DRAM must be refreshed periodically to prevent the data from being lost.
The main difference between SRAM and DRAM is that SRAM stores data in flip-flops, while DRAM stores data in capacitors. This difference in storage mechanism has several implications:
</p>

<ul class="org-ul">
<li>Basic Unit: SRAM use <i>flip-flops</i> and DRAM use <i>capacitors</i>. A filp-flop consists of six transistors maybe, and a capacitor is made of one or two transistors.</li>
<li>Speed: SRAM is faster than DRAM because it does not need to be refreshed periodically.</li>
<li>Cost: SRAM is more expensive than DRAM because it requires more transistors per bit of storage.</li>
<li>Density: DRAM is denser than SRAM because it can store more data in the same amount of space.</li>
<li>Refresh rate: SRAM does not need refreshing, while that DRAM need refreshing.</li>
</ul>

<hr />

<ul class="org-ul">
<li><i>two-level coding structure</i>: we refresh a row every time, leaving time for we to access.</li>
</ul>

<p>
In the context of DRAM (Dynamic Random Access Memory), a row refers to a set of memory cells that share a common word line. A word line is an electrical line that selects a row of cells in the memory array. When a row is selected, all the cells in that row can be accessed simultaneously.
</p>

<p>
If a word is 32 bits long and there are 1024 words, then there would be 1024 rows and each row would have 32 bits. Each bit in a row would correspond to one memory cell. 
</p>

<ul class="org-ul">
<li><i>buffer, bank, and the structure</i></li>
</ul>

<p>
A DRAM has a <b>buffer</b> (if it has one bank), the buffer is used to hold a row of data. It works like SRAM. A <b>row</b> is loaded to the buffer for the sake of temporal locality. There is a buffer for one <b>bank</b>. A DRAM can have many banks. So DRAM has many buffers available. For more information please check the book.
</p>

<p>
There is the quote to the book: 
</p>

<blockquote>
<p>
The row organization that helps with refresh also helps with
performance. To improve performance, DRAMs buffer rows for repeated
access. The buffer acts like an SRAM; by changing the address, random
bits can be accessed in the buffer until the next row access. This
capability improves the access time significantly, since the access
time to bits in the row is much lower. Making the chip wider also
improves the memory bandwidth of the chip. When the row is in the
buffer, it can be transferred by successive addresses at whatever the
width of the DRAM is (typically 4, 8, or 16 bits), or by specifying a
block transfer and the starting address within the buffer.
</p>

<p>
Sustaining that much bandwidth requires clever organization inside the
DRAM.  Instead of just a faster row buffer, the DRAM can be internally
organized to read or write from multiple banks, with each having its
own row buffer. Sending an address to several banks permits them all
to read or write simultaneously. For example, with four banks, there
is just one access time and then accesses rotate between the four
banks to supply four times the bandwidth. This rotating access scheme
is called <b>address interleaving</b>.
</p>
</blockquote>
<p>
End of the Quote.
</p>

<hr />
<ul class="org-ul">
<li><i>SDRAM, in a burst</i></li>
</ul>

<p>
<i>S</i> stands for synchronize. It is to say, a clock is added to DRAM to deal with synchronization problem. Let us see what <b>New Bing</b> said: 
</p>

<blockquote>
<p>
SDRAM (Synchronous Dynamic Random Access Memory) is able to transfer data in a burst without having to specify additional address bits by using a clock to synchronize the data transfers. Once the initial address is specified, the clock is used to transfer the successive data in the burst. The clock generates a series of pulses at regular intervals, and each pulse triggers the transfer of the next piece of data in the burst. This means that the data can be transferred more quickly and efficiently without having to specify additional address bits for each piece of data in the burst.
</p>
</blockquote>

<p>
End of the Quote.
</p>

<p>
And there is actually a weird question: what is "in a burst"? It seems that "a burst transfer" is different to "a block transfer". A burst is like ejaculation&#x2014;it starts and just goes on till the end. A block is like I don't know, 搬砖? Anyway, this is what <b>NB</b> said: 
</p>

<blockquote>
<p>
A burst transfer refers to the transfer of a group of data sequentially in rapid succession. In the context of synchronous DRAMs (Dynamic Random Access Memory), this means that once the initial address is specified, the successive data in the burst can be transferred without having to specify additional address bits. Instead, the clock is used to transfer the successive data in the burst.
</p>

<p>
A block transfer, on the other hand, refers to the transfer of a block of data from one location to another. The difference between a burst and a block transfer is that a burst transfer transfers data sequentially in rapid succession, while a block transfer transfers a block of data as a whole.
</p>
</blockquote>
<p>
End of the Quote.
</p>
<hr />
<ul class="org-ul">
<li><i>flash memory, wear leveling</i></li>
</ul>

<p>
I shall just copy the text, since it is not long.
</p>

<blockquote>
<p>
<b>Flash memory</b> is a type of electrically erasable programmable read-only memory
(EEPROM).
</p>

<p>
Unlike disks and DRAM, but like other EEPROM technologies, <i>writes can wear out
flash memory bits</i>. To cope with such limits, most flash products include a controller
to <i>spread the writes</i> by remapping blocks that have been written many times to less
trodden blocks. This technique is called <b>wear leveling</b>. With wear leveling, personal
mobile devices are very unlikely to exceed the write limits in the flash. Such wear
leveling lowers the potential performance of flash, but it is needed unless higher-level 
software monitors block wear. Flash controllers that perform wear leveling can
also improve yield by mapping out memory cells that were manufactured incorrectly.
</p>
</blockquote>
<p>
End of the Quote. "trodden" is "tread".
</p>

<hr />
<ul class="org-ul">
<li><i>DIMM</i></li>
</ul>

<p>
You may skip the part. This part seems not so important. And here the text that is processed by <b>NB</b>:
</p>
<blockquote>
<p>
A DIMM (Dual In-line Memory Module) is a small circuit board that contains one or several dynamic random-access memory (DRAM) chips. DIMMs are commonly used to add memory to personal computers, workstations, printers, and servers. They are designed to be 64 bits wide, enabling fast data transfer.
</p>

<p>
The text you provided explains that memory for servers is commonly sold on DIMMs. These modules typically contain 4-16 DRAMs and are normally organized to be 8 bytes wide for server systems. A DIMM using DDR4-3200 SDRAMs could transfer at a rate of 8 × 3200 = 25,600 megabytes per second. Such DIMMs are named after their bandwidth: PC25600.
</p>

<p>
Since a DIMM can have many DRAM chips and only a portion of them are used for a particular transfer, the term “memory rank” is used to refer to the subset of chips in a DIMM that share common address lines.
</p>
</blockquote>
<p>
End of the Quote. I have no idea what is "memory rank".
</p>

<hr />
<ul class="org-ul">
<li><i>Magnetic Disk</i></li>
</ul>

<p>
Let us just skip this part
</p>
<hr />
</div>
</div>
