art/note/chapter06_riscv_book.html
<div id="outline-container-org03f72a4" class="outline-3">
<h3 id="org03f72a4"><span class="section-number-3">1.3</span> The Basic of Caches</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org7e3f789" class="outline-4">
<h4 id="org7e3f789"><span class="section-number-4">1.3.1</span> A Small Intro</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li><i>Cache</i>: cache is word referring to the safe space. Just like in the example, you table where there are books that you need is the cache. Here we called the space that is between the memory and the process as <b>cache</b>.</li>

<li><i>The structure of Cache</i>: Cache is a smaller space between the memory and processor. When the processor want to access some data that is in the memory it does not directly access to the memory. Instead, it access to the cache. If the cache does hold the data (hit), the speed is considerably enhanced.</li>

<li><i>block</i>: A block has many bytes (or just one). Block size is very critical to the performance of the cache.</li>

<li><i>direct mapped</i>:we use the address of the <b>block</b> to determine the position in the cache. And usually we know that the address in the cache is:</li>
</ul>
<p>
\[
\rm (Block\ Address) \bmod{(Number\ of\ blocks\ in\ the\ cache)}
\]
</p>
</div>
</div>

<div id="outline-container-orga85c814" class="outline-4">
<h4 id="orga85c814"><span class="section-number-4">1.3.2</span> Accessing to the Cache</h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li><i>cache index field</i>: the index of the block in cache.</li>
<li><i>tag field</i>: the tag is used to identify the blocks. For example, we have block address</li>
<li><i>valid bit</i>: There is a valid bit every one block to indicate if the block are valid.</li>
</ul>

<hr />

<ul class="org-ul">
<li><i>calculation of the field</i></li>
</ul>
<p>
Three steps:
</p>

<ol class="org-ol">
<li>We find the block address: \( {\rm Block\ Address =  (Address ) } /2 ^{m+2}\), that is we get rid of the low \(m+2\) bits.</li>
<li>We find the lower \(n\) bits of the block address. \( {\rm Index = (Block \ Address) }\bmod{2^n} \), that is we get the lower \(n\) bits. that is the index.</li>
<li>We find the higher \( 64 - m -  2 - n \) bits of block address, which is the <i>tag field</i>.</li>
</ol>

<hr />
<ul class="org-ul">
<li><i>calculate the bits in the cache</i></li>
</ul>

<p>
You shall see the example on the book.
</p>

<hr />
<ul class="org-ul">
<li><i>Block size</i></li>
</ul>

<p>
It is wrong that the bigger the block size, the better. While big block size may enhance hit rate, it also enhance the miss penalty.
You shall check for the book. Here is the quote:
</p>
<blockquote>
<p>
Larger blocks exploit spatial locality to lower miss rates. As Figure 5.11 shows,
increasing the block size usually decreases the miss rate. The miss rate may go up
eventually if the block size becomes a significant fraction of the cache size, because
the number of blocks that can be held in the cache will become small, and there will
be a great deal of competition for those blocks. As a result, a block will be bumped
out of the cache before many of its words are accessed. Stated alternatively, spatial
locality among the words in a block decreases with a very large block; consequently,
the benefits to the miss rate become smaller.
</p>

<p>
A more serious problem associated with just increasing the block size is that the
cost of a miss rises. The miss penalty is determined by the time required to fetch
the block from the next lower level of the hierarchy and load it into the cache. The
time to fetch the block has two parts: the latency to the first word and the transfer
time for the rest of the block. Clearly, unless we change the memory system, the
transfer time—and hence the miss penalty—will likely increase as the block size
expands. Furthermore, the improvement in the miss rate starts to decrease as the
blocks become larger. The result is that the increase in the miss penalty overwhelms
the decrease in the miss rate for blocks that are too large, and cache performance
thus decreases. Of course, if we design the memory to transfer larger blocks more
efficiently, we can increase the block size and obtain further improvements in cache
performance. We discuss this topic in the next section.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgb8d28a8" class="outline-4">
<h4 id="orgb8d28a8"><span class="section-number-4">1.3.3</span> Handling Cache Misses</h4>
<div class="outline-text-4" id="text-1-3-3">
<ul class="org-ul">
<li><i>Handling miss</i></li>
</ul>

<p>
Four steps when miss happens.
</p>
</div>
</div>
<div id="outline-container-org6b5eead" class="outline-4">
<h4 id="org6b5eead"><span class="section-number-4">1.3.4</span> Handling Writes</h4>
<div class="outline-text-4" id="text-1-3-4">
<ul class="org-ul">
<li><i>Consistent and Inconsistent</i></li>
<li><i>Write Through</i>
<ul class="org-ul">
<li><i>Write Queue</i></li>
</ul></li>
<li><i>Write Back</i></li>
</ul>
<hr />
<p>
Elaboration: WHAT THE FUCK?
</p>
<hr />
<ul class="org-ul">
<li><i>An Example of the Intrinsity FastMATH Processor</i></li>
</ul>
</div>
</div>

<div id="outline-container-org57819bf" class="outline-4">
<h4 id="org57819bf"><span class="section-number-4">1.3.5</span> Summary of the Section</h4>
<div class="outline-text-4" id="text-1-3-5">
<p>
I will just copy the summary parts.
</p>

<blockquote>
<p>
We began the previous section by examining the simplest of caches: a direct-mapped
cache with a one-word block. In such a cache, both hits and misses are simple, since
a word can go in exactly one location and there is a separate tag for every word. To
keep the cache and memory consistent, a write-through scheme can be used, so
that every write into the cache also causes memory to be updated. The alternative
to write-through is a write-back scheme that copies a block back to memory when
it is replaced; we’ll discuss this scheme further in upcoming sections.
</p>

<p>
To take advantage of spatial locality, a cache must have a block size larger than
one word. The use of a bigger block decreases the miss rate and improves the
efficiency of the cache by reducing the amount of tag storage relative to the amount
of data storage in the cache. Although a larger block size decreases the miss rate, it
can also increase the miss penalty. If the miss penalty increased linearly with the
block size, larger blocks could easily lead to lower performance.
</p>

<p>
To avoid performance loss, the bandwidth of main memory is increased to
transfer cache blocks more efficiently. Common methods for increasing bandwidth
external to the DRAM are making the memory wider and interleaving. DRAM
designers have steadily improved the interface between the processor and memory
to increase the bandwidth of burst mode transfers to reduce the cost of larger cache
block sizes.
</p>
</blockquote>

<p>
End of the Quote. Check yourself:
</p>

<p>
The speed of the memory system affects the designer’s decision on the size of
the cache block. Which of the following cache designer guidelines is generally
valid?
</p>
<ol class="org-ol">
<li>The shorter the memory latency, the smaller the cache block</li>
<li>The shorter the memory latency, the larger the cache block</li>
<li>The higher the memory bandwidth, the smaller the cache block</li>
<li>The higher the memory bandwidth, the larger the cache block</li>
</ol>

<p>
Here is the answer from <b>NB</b>:
</p>
<blockquote>
<p>
Memory latency refers to the time it takes to access data from memory. When memory latency is short, it takes less time to transfer data from memory to the cache. This means that larger cache blocks can be used without significantly impacting performance. Larger cache blocks can take advantage of spatial locality by fetching more data that is likely to be accessed in the near future.
</p>

<p>
Memory bandwidth refers to the amount of data that can be transferred from memory to the cache in a given amount of time. When memory bandwidth is high, more data can be transferred from memory to the cache in a given amount of time. This means that larger cache blocks can be used without significantly impacting performance. Larger cache blocks can take advantage of spatial locality by fetching more data that is likely to be accessed in the near future.
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-org0454f45" class="outline-3">
<h3 id="org0454f45"><span class="section-number-3">1.4</span> Measuring and Improving Cache Performance</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-05-31 Wed 12:51</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>